{ 
    "_id" : ObjectId("57010a2dddc5778a2700cfc3"), 
    "Name" : "Engine Performance", 
    "Description" : "Service to maintain engine performance, sometimes known as a tune-up, keeps your engine working hand-in-hand with the rest of your car’s powertrain. This is how optimum car performance is achieved.\r\n\r\n\r\nWHY DO I NEED THIS SERVICE?\r\n\r\nA well-tuned engine delivers the best balance of power and fuel economy and produces the lowest level of emissions. Modern engines compensate for worn parts to a degree, giving you the sense that everything is fine with your car. Keeping your engine tuned will restore your car to its normal operating state, and contribute to the overall efficiency of the engine and emissions system. The Environmental Protection Agency (EPA) says a wellmaintained car is more fuel-efficient, produces fewer greenhouse gas emissions, is more reliable and is safer!\r\n\r\nTYPICAL SERVICE\r\n\r\n• Based on spark plug type, the replacement interval can range from 30,000 to 100,000 miles.\r\n• Replace any other ignition system and/or emissions system parts that may be needed or recommended.\r\n• Replace the fuel and air filters."
}
{ 
    "_id" : ObjectId("57010b1fddc5778a2700cfc7"), 
    "Name" : "Oil, Filters and Fluids", 
    "Description" : "Critical parts of your engine are lubricated, cleaned and cooled by your car’s oil and filter. Other specifically formulated fluids are used for the operation and protection of systems and components such as brakes, cooling, power steering, automatic and manual transmissions, and transfer cases. Your car may also be equipped with a variety of filters including those for the transmission, fuel system and interior ventilation.\r\n\r\n\r\nWHY DO I NEED THIS SERVICE?\r\n\r\nPeriodic oil and filter changes help keep your engine clean on the inside. Dust, metallic shavings, condensation and even antifreeze can contaminate motor oil. Additives, which break down over time, are also subject to contamination. Other fluids in your vehicle may require periodic replacement. For example, the majority of automatic transmission failures are heat-related, and automatic transmission fluid breaks down rapidly when subjected to high temperatures. Your car owner’s manual may specify periodic flushing and filling of the brake hydraulic system because contaminated brake fluid may lead to corrosion and other problems in the hydraulic system, especially on vehicles with anti-lock brakes (ABS).\r\n\r\nTYPICAL SERVICE\r\n\r\n• Oil level should be checked frequently and changed every 3,000 - 5,000 miles or as directed in the owner’s manual.\r\n• If you regularly make short trips in your car, drive in stop-andgo traffic, idle for extended periods, drive in dusty or dirty air conditions, tow a trailer or live in a cold-weather region, stay with the 3,000-mile/three-month schedule because you are considered a severe driver.\r\n• Many car manufacturers recommend extended oil drain intervals for some drivers.\r\n• For automatic transmissions, brakes, power steering and axles, vehicle-specific fluids should be used.\r\n• Coolant should be changed periodically as specified in the owner’s manual. Coolant fluid type and interval schedule will vary by vehicle."
}
{ 
    "_id" : ObjectId("57010b24ddc5778a2700cfc8"), 
    "Name" : "Belts and Hoses", 
    "Description" : "Many experts recommend replacing belts, radiator and heater hoses at specific intervals to prevent your car from breaking down. Losing a belt today can mean big trouble for the engine because serpentine belts are used on most engines to turn the water pump, alternator, power steering and air-conditioning compressor. \r\n\r\nIf the serpentine belt fails or breaks, the engine will fail to run and you may be stranded. Older cars use V-belts for various accessories and failure of this belt could also strand you. A blown hose could result in an overheated engine and can cause additional engine damage.\r\n\r\n\r\nWHY DO I NEED THIS SERVICE?\r\n\r\nIt’s not easy to know the true condition of a belt or hose by its outward appearance, because most belts and hoses fail from the inside out. Rubber hoses can become hard and brittle, deteriorating with age and exposure to heat, causing the hose to split, blister or leak. Belts also break down with heat, mileage and age. Every time a belt passes around a pulley, it bends. Flexing produces heat that causes the rubber to harden over time. In addition, if the belt is loose or slips, the wear process can be accelerated.\r\n\r\nTYPICAL SERVICE\r\n\r\n• Hoses should be inspected at each oil change for leaking, cracks, discoloration or any other visual sign of wear. Squeezing the hose can also indicate need for replacement. Any hose that feels rockhard or mushy should be replaced.\r\n• Hoses should always be replaced with a new radiator or water pump installation.\r\n• Clamps should be replaced when new hoses are installed.\r\n• V-belts should be inspected for looseness, cracks, frays or glazing. Typical replacement is every three to four years or 40,000 to 50,000 miles.\r\n• The serpentine belt system should be inspected for looseness and signs of wear. Tensioners and pulleys should be inspected for noise and wear. Typical replacement is 60,000 to 90,000 miles. The system may also require replacement of a tensioner or pulley.\r\n• Replace timing belts based on the interval specified in the owner’s manual, typically between 60,000 and 90,000 miles. During a timing belt service it may be recommended to replace tensioner, pulleys, and water pump."
}
{ 
    "_id" : ObjectId("57010b29ddc5778a2700cfc9"), 
    "Name" : "Brake Service", 
    "Description" : "The brake system is your car’s most important safety system. Never put off routine brake inspections or any needed repair.\r\n\r\n\r\nWHY DO I NEED THIS SERVICE?\r\n\r\nBrakes are a normal wear item for any car. Eventually, they’re going to need to be replaced for both performance and safety reasons. Don’t let your brakes get to the “metal-to-metal” point, which usually means more expensive rotor or drum replacement. Your car owner’s manual might specify periodic flushing and filling of the brake hydraulic system. Contaminated brake fluid may lead to corrosion and other problems in the hydraulic system, especially on cars with anti-lock brakes (ABS).\r\n\r\nTYPICAL SERVICE\r\n\r\n• Have your brake pads and shoes, drums and rotors, master cylinders, wheel cylinders, brake hoses, calipers, brake hardware and brake fluid inspected.\r\n• Depending on the condition or thickness of the drums or rotors, resurfacing or replacement may be necessary.\r\n• The parking brake should also be checked for proper operation and adjustment. In some cases, the parking brake shoes/pads may need replacement."
}
{ 
    "_id" : ObjectId("57010d58ddc5778a2700cfca"), 
    "Name" : "Wheels and Tires", 
    "Description" : "Tires are your car’s critical connection to the road and can affect your ride, handling, traction and safety. Maintaining tire balance and wheel alignment reduces tire wear and improves handling and fuel economy.\r\n\r\n\r\nWHY DO I NEED THIS SERVICE?\r\n\r\nTire replacement is necessary if the tread depth is below the minimum legal requirement, or the sidewalls are severely cracked or punctured. In some cases, tread punctures cannot be repaired. Normal wear and road conditions can take their toll on your car’s steering and suspension system, and can disrupt the alignment settings. Ball joints, tie rods, steering arms, bushings and other suspension parts all wear gradually over time. Springs will gradually sag and age as miles accumulate. All of these will affect alignment angles and adjustments need to be made or components replaced to restore optimum handling.\r\n\r\nTYPICAL SERVICE\r\n\r\n• Have your car’s alignment (all four wheels) checked at least annually and also at the first sign of improper handling or uneven wear. Your technician will make adjustments to the camber, caster, toe and thrust angle as needed.\r\n• Request a wheel alignment when you purchase a set of new tires.\r\n• Check inflation pressure at least once a month (including the spare).\r\n• Have the tires rotated every 6,000 miles. Consult your owner’s manual, tire dealer or manufacturer for the correct rotation pattern for your tires.\r\n• Rotation time also serves as a good opportunity to have the wheels balanced. Unbalanced wheels can cause rapid wear of shock absorbers and struts, and wheel balance can change as a result of normal tire wear. Rotating the tires to keep their sizes equal is critical on full-time four-wheel drive vehicles, and replacing all four tires at the same time, is highly recommended.\r\n• The Tire Pressure Monitoring System (TPMS) may need to be replaced when servicing or installing new tires."
}
{ 
    "_id" : ObjectId("57010d5cddc5778a2700cfcb"), 
    "Name" : "Check Engine Light", 
    "Description" : "In 1996, an orange light on your car’s dashboard labeled “Check Engine” or “Service Engine Soon” became standard on all car makes and models. The light tells you there’s a problem with your car’s engine and powertrain control system.\r\n\r\n\r\nWHY DO I NEED THIS SERVICE?\r\n\r\nAn illuminated “Check Engine” or “Service Engine Soon” light indicates that a vehicle system, such as the ignition, fuel injection or emission control, is not operating properly, even if the vehicle appears to be running normally. Only the right diagnostic equipment can determine the problem detected by your car’s on-board diagnostic system (OBD). Ignoring a check engine light can negatively impact your fuel economy or cause damage resulting in more costly repairs.\r\n\r\nTYPICAL SERVICE\r\n\r\n• A steady light should be diagnosed at the first convenient opportunity.\r\n• A flashing light indicates a problem that is currently happening and may require immediate attention, such as catalytic converter damage.\r\n• A technician connects a diagnostic scan tool to your car’s computer system to determine the problem.\r\n• Further testing and diagnosis may be required to pinpoint the exact cause of the problem.\r\n• Once the problem is pinpointed, repairs are made and the light is reset."
}
{ 
    "_id" : ObjectId("57010d61ddc5778a2700cfcc"), 
    "Name" : "Air Conditioning Service", 
    "Description" : "Your car’s heating, ventilating and air conditioning system (HVAC) keeps your car interior comfortable in any season by providing the right temperature and humidity level. The HVAC system also helps improve defroster operation.\r\n\r\n\r\nWHY DO I NEED THIS SERVICE?\r\n\r\nProper heating and cooling performance is critical for interior comfort and for safety reasons such as defrosting. The HVAC system will work as designed if properly serviced.\r\n\r\nTYPICAL SERVICE\r\n\r\n• A thorough inspection of your car’s HVAC system should be performed annually.\r\n• A service technician checks pressures to test operation, refrigerant charge and outlet temperatures.\r\n• If the system is found to be low on refrigerant, a leak test is performed to find the source of the leak.\r\n• A technician may also check for evidence of refrigerant cross-contamination, which is the mixing of refrigerants.\r\n• A/C service should also include a check of the compressor’s drive belt and tension."
}
{ 
    "_id" : ObjectId("57010d6addc5778a2700cfcf"), 
    "Name" : "Appearance", 
    "Description" : "Keeping a vehicle looking new is tough, even with today’s long-lasting finishes. Dents, dings, cracked glass and dirty upholstery are several items that age the appearance of a vehicle. Fortunately, technology and advances in vehicle protectants have helped rectify these problems, making the fixes quicker and less expensive.\r\n\r\n\r\nWHY DO I NEED THIS SERVICE?\r\n\r\nCaring for your car’s appearance helps you protect your investment. Appearance problems left unattended, like breaks in glass or body damage, can lead to larger problems and repairs.\r\n\r\nTYPICAL SERVICE\r\n\r\n• Frequent washing and periodic vehicle polishing go a long way toward protecting your investment.\r\n• Keeping your vehicle consistently clean prevents the buildup of damaging chemicals and dirt that may damage your car’s finish.\r\n• In areas of the country that use road salt in winter months, frequent washing can reduce the corrosive effects of salt that cause body rust-through.\r\n• Always use a different mitt for the tires and wheels than is used for the body and paint.\r\n• To prevent stripping the vehicle’s finish, only soap specified for automotive cleaning should be used."
}
{ 
    "_id" : ObjectId("570115ffddc5778a2700cfd4"), 
    "Name" : "Mufflers & Exhaust Service", 
    "Description" : "You may think your car’s exhaust system is designed only to reduce noise, but it is also responsible for reducing harmful emissions from entering the atmosphere.- Properly functioning mufflers and exhaust systems not only sound better, they are better – for you, your car, and the environment. \r\n\r\nYour exhaust system really starts at the front of your car, right behind your engine. Exhaust manifolds connect to the cylinder heads, where they collect exhaust gases. As the gases move through the exhaust system, they're first analyzed by oxygen sensors, then refined by the catalytic converter and, finally, muffled by the muffler. \r\n\r\nSo by the time those gases leave the vehicle, your emission system has made your car run smoother, cleaner, and quieter. \r\n\r\nAny one of these components can fail and affect everything from your gas mileage to the air you breathe. It's a pretty complex system, but our emissions and muffler repair experts can diagnose the problem and get you right back on the road."
}
{ 
    "_id" : ObjectId("57011605ddc5778a2700cfd5"), 
    "Name" : "Lights & Wipers", 
    "Description" : "We can help improve your visibility by inspecting windshield wiper blades, headlamps, turn signals, and brake lights, and by filling your windshield washer fluid.\r\n\r\nWhether your car has conventional headlights, halogen headlamps, or the latest xenon car lights, the trained technicians at your Midas can diagnose headlight problems and light your way to clearer driving.\r\n\r\nIn addition to headlamps, other lights available from Midas include:\r\n\r\nTail, park, and brake lights\r\nTurn signals\r\nInterior lamps\r\nHazard flashers\r\n\r\nYour neighborhood Midas can also replace worn windshield wipers that will keep your windshield clear in all types of weather.\r\n\r\nWhile you’re in the store, let us run through the Midas Touch® Courtesy Check. We’ll conduct a visual check, looking inside, outside, under the hood and under the vehicle, then provide a written report. It’s fast, efficient and covers many items on your vehicle’s preventive maintenance plan, including inspection of lights and wiper blades.\r\n\r\nSchedule an appointment at your local Midas to make sure your car is ready for the road ahead. Use the quick links in the gold bar to book your appointment today!"
}
{ 
    "_id" : ObjectId("57011609ddc5778a2700cfd6"), 
    "Name" : "Steering, Suspension & Alignment", 
    "Description" : "Steering Repair\r\nIf you count drive time as an upper body workout because your car wants to turn when you want to go straight, you may have steering system problems.\r\n\r\nMidas has the latest diagnostic equipment and our ASE-certified technicians will determine the cause of your steering problems and get you back to effortless driving with steering repair and steering fluid flush services.\r\n\r\n\r\nCar Suspension\r\nDoes your car dip or rock when you go over bumps or drift around corners even at low speeds?\r\n\r\nIf you answered yes, it may be time to replace your vehicle’s shocks or struts.\r\n\r\nWhether your car or truck has shock absorbers or a strut-based system typical in many front-wheel-drive cars, your local Midas store has the car suspension know-how to diagnose and repair any problem and get you back on the road with a smooth ride.\r\n\r\n\r\nWheel Alignment\r\nPotholes and rough road surfaces don’t just make for a bad ride, they can affect the alignment of your wheels.\r\n\r\nMisaligned wheels can cause a host of problems, including uneven tire wear.\r\n\r\nProper wheel alignment helps your tires last longer, improves gas mileage, and provides safer handling. That’s what Midas is all about – helping you get the most out of your car, for as long as you own it."
}
{ 
    "_id" : ObjectId("5701177cddc5778a2700cfd7"), 
    "Name" : "Car Batteries, Starting & Charging", 
    "Description" : "Car Batteries\r\nMidas-trained professionals can test your car battery, replace it if necessary, and provide you with the comfort that comes with knowing your car will start when you need it to.\r\n\r\nWe offer car batteries from leading brands. So if you've got a car battery problem, we'll get you on your way in no time with ­high-quality car batteries guaranteed by the manufacturer* and backed by over 1,400 locations across North America.\r\n\r\nAsk for a car battery check at your neighborhood Midas today.\r\n\r\n* Most vehicles. See manager for limited guarantee terms.\r\n\r\n\r\nStarting & Charging\r\nIf your car won’t start, the car battery isn’t the only suspect. The starter, alternator, and spark plugs can also be trouble spots.\r\n\r\nThe car battery provides the charge that starts the engine and powers accessories such as lights and wipers.\r\n\r\nThe starter can fail due to electrical or mechanical problems, making your car difficult or impossible to start.\r\n\r\nIf your alternator is not working properly, you may notice headlights or interior lights that dim and brighten on their own, or other odd electrical behavior in the car.\r\n\r\nThe trained mechanics at your neighborhood Midas can evaluate any starting and electrical issues you experience and repair or replace the parts causing problems.\r\n\r\n\r\n\r\nHow it Works\r\nIn addition to the car battery, there are two other major components to your vehicle's starting and charging system. And these two components must be in good working order for your vehicle to start and run properly.\r\n\r\nStarter — when you turn the ignition key, you are actually turning on the starter, which then cranks the engine. When a starter isn't working correctly, the engine may start with great difficulty, or not at all. Starter problems may be due to electrical/mechanical failure or outright breakage.\r\n\r\nAlternator — the alternator carries out two important tasks. It recharges your battery while the vehicle is running to keep it at peak starting power. The alternator also works with your battery as a team to operate electrical components, such as headlights, windshield wipers, and more. A malfunctioning alternator can cause electrical components to operate erratically, or even cause your engine to suddenly stop running.\r\n\r\nWhat to Watch For\r\nIf you experience battery trouble, there are a couple of things you may want to check before calling for service.\r\n\r\nBe sure the battery is properly secured. Vibration caused by an unsecured battery can affect battery life.\r\n\r\nThe cables to the battery terminals must be clean and tightly connected. Buildup of corrosive elements on the terminals can seriously weaken starting power. Be sure the side terminals aren't over-tightened as well."
}
{ 
    "_id" : ObjectId("5701177fddc5778a2700cfd8"), 
    "Name" : "Radiator & Engine Cooling", 
    "Description" : "Car overheating can come from a variety of sources. With engine combustion temperatures reaching 2000° F and higher, there is a lot of heat to deal with. If your engine is running hotter than normal, either shortly after starting or over time, or if you find coolant (commonly referred to as antifreeze) puddled beneath your car, it's probably time to stop by your neighborhood Midas for an inspection.\r\n\r\nWithout a properly functioning cooling system, heat levels produced by your car’s engine are great enough to damage the components of the engine itself. Aluminum heads can warp. Head gaskets can blow. Engines can fail. And those are all big ticket repairs.\r\n\r\nCount on Midas to help keep your car's cooling system operating safely and efficiently and avoid preventable repair expenses. We recommend having coolant replacement performed according to your car’s factory-recommended maintenance schedule. This regular maintenance of your vehicle's radiator and cooling system can help avoid car overheating and costly repair services. And it’ll help keep you off the side of the road.\r\n\r\nStop by your local Midas with any questions or to determine when your vehicle needs this critical service.\r\n\r\n\r\n\r\nA properly functioning cooling system, which circulates antifreeze/coolant and dissipates the heat away from the engine, is absolutely necessary to prevent car overheating and destructive engine temperatures.\r\n\r\nYour vehicle has five principal components in its cooling system.\r\n\r\nRadiator — an auto radiator has a set of tubes called the \"core\" that the coolant flows through. Cooling fins surround the core. As air passes through the fins, the coolant releases its heat to the fins, which dissipate the heat.\r\nRadiator cap — there has to be a place to pour in coolant and the radiator cap covers that filling hole. The cap is also designed to seal the system to a specific pressure.\r\nRadiator hoses — the coolant goes from the radiator to the engine through a series of hoses that are sturdy and flexible enough to handle engine vibration and high heat.\r\nThermostat — like the device on your home heating/cooling system, the engine thermostat keeps the engine at the proper operating temperature.\r\nWater pump — this is the heart of the engine cooling system. It pumps coolant through the whole cooling system, and into the engine block.\r\n \r\n"
}
